_protected/controllers/AirportController.php

SELECT * FROM `airports` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Airports::findOne($id)) !== null) {