_protected/controllers/UserController.php

    public function actionUpdate($id)
    {
        // get role
        $role = Role::findOne(['user_id' => $id]);

        // get user details
        $user = $this->findModel($id);

        // only The Creator can update everyone`s roles
        // admin will not be able to update role of theCreator
        if (!Yii::$app->user->can('theCreator'))
        {
            if ($role->item_name === 'theCreator')
            {
                return $this->goHome();
            }
        }

        // load user data with role and validate them
        if ($user->load(Yii::$app->request->post()) &&
            $role->load(Yii::$app->request->post()) && Model::validateMultiple([$user, $role]))
---
SELECT * FROM `auth_item` WHERE `name`='theCreator'

                $user->removeAccountActivationToken();
            }

            $user->save(false);
---
UPDATE `user` SET `status`=10, `updated_at`=1435952766 WHERE `id`=4

    protected function findModel($id)
    {
        if (($model = User::findOne($id)) !== null)
---
SELECT * FROM `user` WHERE `id`='4'