_protected/rbac/models/AuthItem.php

SELECT `name` FROM `auth_item` WHERE (`type`=1) AND (`name` != 'theCreator')
---
    public static function getRoles()
    {
        // we make sure that only The Creator can see theCreator role in drop down list
        if (Yii::$app->user->can('theCreator'))
        {
            return static::find()->select('name')->where(['type' => 1])->andWhere(['!=','name','theCreator'])->all();
        }
        // admin can not see theCreator role in drop down list
        else
        {
            return static::find()->select('name')
                                 ->where(['type' => 1])
                                 ->andWhere(['!=', 'name', 'theCreator'])
                                 ->all();