_protected/views/airport/admin.php

SELECT COUNT(*) FROM `airports`
---
                },
            ],
            [
                'attribute'=>'airport_name',
                'value' => function ($data) {
                    return $data->airport_name;
                },
            ],
            [
                'attribute'=>'country',
                'value' => function ($data) {
                    return $data->country;
                },
            ],
            [
                'attribute'=>'city',
                'value' => function ($data) {
                    return $data->city;
                },
            ],
            ['class' => 'yii\grid\ActionColumn',
            'header' => Yii::t('app', 'Menu')],
        ],
    ]); ?>